app/controllers/heroes_controller.rb

SELECT "heros".* FROM "heros"
---
  def index
    @heroes = Hero.all.sort_by{|x| x.faction}

INSERT INTO "stats" ("health", "attack", "armor", "speed", "hero_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["health", 2], ["attack", 2], ["armor", 2], ["speed", 2], ["hero_id", 7], ["created_at", "2017-05-24 20:36:30.238989"], ["updated_at", "2017-05-24 20:36:30.238989"]]
---
  def create
    @hero = Hero.new(hero_params)
    @stat = Stat.new(stats_params["stats"])
    @hero.stat = @stat
    if @hero.save && @stat.save

SELECT  "stats".* FROM "stats" WHERE "stats"."hero_id" = ? LIMIT 1  [["hero_id", 4]]
---
  def update
    @hero = Hero.find_by(id: params[:id])
    @stat = Stat.find_by(id: params[:id])