app/views/heroes/index.html.erb

<script type="text/javascript" charset="utf-8">
$(function() {
  $(".js-more").on("click", function() {
    var id = $(this).data("id");
    $.get("/heroes/" + id + ".json", function(data) {
      var stats = data.stat
      var statsList = ""
      for (var i in stats){
        statsList += '<li class="js-stat" data-id="' + data.id + '">' + i + ': ' + stats[i] + '</li>';
      }
      $("#heroes-" + id + "-stats").html(statsList);
    });
  });
});
---
SELECT  "stats".* FROM "stats" WHERE "stats"."hero_id" = ? LIMIT 1  [["hero_id", 10]]